# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 10
b = -5
s = a + b
diff = a - b
m = a*b
print("a=" + str(a) + "\nb=" + str(b) + "\na+b=" + str(s) + "\na-b=" + str(diff) + "\na*b=" + str(m))
