#  Task_01
#  Даны 2 действительных числа a и b. Получить их сумму, разность ипроизведение.

a = 5
b = 3

c = (a + b)
d = (a - b)

print(c, d)
