# Создать строку равную введенной строке без последних двух символов.

hello_wor = 'hello_world'
print(hello_wor, '-', 'строка без последних двух символов:', hello_wor[:9])
