# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

def v(a):
    return a ** 3


print('Объем куба равен: ', v(5))


def pick(b):
    return b ** 2


print('Площадь боковой поверхности куба равна:', pick(5))
