# Создать строку равную первым пяти символам введенной строки.

summe = 'summer_in_Belarus_2021'
print(summe, '-', 'первые пять символов:', summe[:5])

