# Создать строку равную всем элементам введенной строки с четными индексами. (считая, что индексация начинается с 0,
# поэтому символы выводятся начиная с первого, индексы 0,2,4,6….).


Batflietrtagy = 'Beautiful is better than ugly.'
print(Batflietrtagy, '-', 'строка с четными индексами:', Batflietrtagy[:30:2])
