# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

def get_sum(a, b):
    return a + b


print(get_sum(5, 3))


def get_diff(a, b):
    return a - b


print(get_diff(13, 7))


def get_multiplication(a, b):
    return a * b


print(get_multiplication(5, 6))