# Создать строку равную третьему символу введенной строки.

D = 'ABCD'
print(D, '-', 'третий символ:', D[3])
