#  Создать переменные firstname, lastname, age с соответствующими значениями.
firstname = input('Please enter your firstname:')
lastname = input('Please enter your lastname:')
age = str(input('Please enter your age:'))

#  Путем сложения получить строку вида Привет, меня зовут Иван Иванов, мне 35 лет
#  Примечание:Переменную age задавать как строку ‘35’
print('Привет, меня зовут', firstname, lastname, ',мне', age, 'лет')
