firstname = "Vitaly "
lastname = "Gorbatko"
age = "35"
print('Привет, меня зовут ' + firstname + lastname + ', мне ' + age + ' лет')
# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида Привет, меня зовут Иван Иванов, мне 35 лет
# Примечание:Переменную age задавать как строку ‘35’
