x = float(input("Enter x"))
y = float(input("Enter y"))
z = (abs(x) - abs(y)) / (1 + abs(x * y))
print(z)
# Даны действительные числа x и y. Получить 1+ |xy|/|x| − |y|
