# Дана длина ребра куба. Найти объем куба и площадь его боковой
# поверхности.
def func_3(a):
    print('Площадь=', (a ** 2)*6, 'Объем=', a ** 3)


x = int(input('x='))

func_3(x)
