# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида Привет, меня зовут Иван Иванов, мне 35 лет
# Примечание:Переменную age задавать как строку ‘35’
firstname = input("Input your name: ")
lastname = input("Input your surname: ")
age = input("Input your age: ")
print("Привет, меня зовут " + firstname + " " + lastname + " мне " + age + " лет")
