"""
Даны действительные числа x и y. Получить (|x| − |y|) /  (1 + |xy|)
"""
x = abs(-10)
y = abs(5)
total = (x - y) / (1 + (x * y))

print(total)
