# Создать строку равную предпоследнему символу введенной строки.

e = input('Ведите строку: ')
print(e, '-', 'предпоследний символ:', e[-2])
