# Создать строку равную введенной строку без последних двух символов.
a = input("введите строку: ")
s1 = a[:-2]
print(s1)
