"""
Создать строку равную третьему символу введенной строки.
"""
a = input()
print(a[2])
