"""
Создать строку равную первым пяти символам введенной строки
"""
a = input()
print(a[0:5])
