"""
Создать переменные firstname, lastname, age с соответствующими значениями
Путем сложения получить строку вида Привет, меня зовут Иван Иванов, мне 35 лет
Примечание:Переменную age задавать как строку ‘35’
"""

first_name = input('Write your first name: ')
last_name = input('Write your last name: ')
age = input('How old are your? ')
print(f'Hi my name is {first_name} {last_name} i am {age} years old')
