# Создать строку равную первым пяти символам введенной строки.

top = input('Введите строку: ')
print(top, '-', 'первые пять символов:', top[:5])
