# Создать строку равную введенной
# строку без последних двух символов

s = 'hello world'
a = s[:-2]
print(a)
