# Создать строку равную введенной строку без последних двух символов.
str = input('Введите строку: ')
print(str[:(len(str) - 2)])
