# Создать список из двух элементов.
# Создать кортеж из двух элементов.
# Создать словарь с одной парой. Ключ - кортеж, значение - список
# Создать словарь с одной парой. Ключ - список, значение - кортеж

a = [1, 2]
b = (3, 4)
d = {a: b}
s = {b: a}
print(a, b)
