# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = 6.8
print(f"Длина ребра куда: a= {a} \nОбьем куба:"
      f" V= {a**3} \nПлощадь бок. пов-ти: S= {4 * a**2}")
