# Создать строку равную предпоследнему символу введенной строки.

e = 'ticket'
print(e, '-', 'предпоследний символ:', e[4])
