# Создать строку равную третьему символу введенной строки
str = input('Введите строку: ')
print(str[2])
