# Даны 2 действительных числа a и b. Получить их сумму, разность и
# произведение.
def func_1(a, b):
    print('Сумма=', (a + b), 'Произведение=', (a * b), 'Разность=', (a - b))


num_1 = int(input('num_1='))
num_2 = int(input('num_2='))

func_1(num_1, num_2)
