Даны действительные числа x и y. Получить (x - y) / (1 + (x * y))
x = 5
y = 10
c = (x - y) / (1 + (x * y))
print(c)
