Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности.
a = 14
v = a ** 3
s = 4 * (a ** 2)
print(v, s)
