Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение.
a = 7
b = 12
c = a + b
d = a - b
f = a * b
print(c, d, f)
