a = "second string"
print(a[-2])
# Создать строку равную предпоследнему символу введенной строки.
