# Создать строку равную третьему символу введенной строки.
a = "first string"
print(a[2])
