# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”
name = input("Введите свое имя: \n")
print(f"Hello, {name}!")
