#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a=10
b=-5
summ=a+b
diff=a-b
mult=a*b
print ("a="+str(a)+"\nb="+str(b)+
       "\na+b="+str(summ)+ "\na-b="+str(diff)+ "\na*b="+str(mult))