# Создать строку равную первым пяти символам введенной строки.

s = 'hello world'
a = s[:5]
print(a)
