"""
Создать строку равную введенной строку без последних двух символов
"""
a = input()
print(a[0:-2])
