# Создать строку равную первым пяти символам введенной строки.
a = "third string"
print(a[:5])
