# Создать строку равную введенной строке без последних двух символов.

port = input('Введите строку: ')
print(port, '-', 'строка без последних двух символов:', port[:-2])
