a = "fourth string"
print(a[:(len(a) - 2)])
# Создать строку равную введенной строку без последних двух символов.
