"""Ввести с клавиатуры имя пользователя.
Вывести на экран “Hello, [name]!"""

a = "Sasha"
print(f'Hello {a}!')
