s = 'hello world'
a = s[:5]
print(a)
# Создать строку равную первым пяти символам введенной строки.
