# Создать строку равную первым пяти символам введенной строки.
str = input('Введите строку: ')
print(str[:5])
