firstname = 'Victoria'
lastname = 'Yushkevich'
age = '21'
print("Hello, my name is %s %s,I am %s years old" % (firstname, lastname, age))
# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида Привет, меня зовут Иван Иванов, мне 35 лет
# Примечание:Переменную age задавать как строку ‘35’
