# Создать строку равную предпоследнему символу введенной строки.
a = input('Enter some string\n')
print(a[-2])
