a = list('ad')
b = tuple('morning')

c = dict(b=a)
d = dict(a=b)
print(c)
print(d)
# Создать список из двух элементов.
# Создать кортеж из двух элементов.
# Создать словарь с одной парой. Ключ - кортеж, значение - список
# Создать словарь с одной парой. Ключ - список, значение - кортеж
