a = float(input("Enter the side of cube"))
v = a ** 3
s = (a ** 2) * 6
print("Cube volume =", v, "Lateral surface area", s)
# Дана длина ребра куба. Найти объем куба и площадь его боковой
# поверхности
