s = 'hello world'
a = s[2]
print(a)
# Создать строку равную третьему символу введенной строки
