#Даны два действительных числа. Найти среднее арифметическое и
#среднее геометрическое этих чисел
import math
a = 5
b = 8
d = (a + b) // 2
c = a * b
sqrt = math.sqrt(c)
print(d, sqrt)
