# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 10
b = -5
print(f"a= {a} \nb= {b} \na+b= {a + b} \na-b= {a - b} \na*b= {a * b}")
