# Получить на ввод количество рублей и копеек и вывести в правильной
# форме, например, 3 рубля, 1 рубль 25 копеек, 3 копейки

a = int(input('Введтите количество рублей'))
b = int(input('Введите количество копеек'))
if b > 100:
    a = a + b // 100
    b = b % 100
if (a % 100) // 10 == 1:
    print(a, 'рублей')
elif a % 10 in (0, 5, 6, 7, 8, 9):
    print(a, 'рублей')
elif a % 10 == 1:
    print(a, 'рубль')
elif a % 10 in (2, 3, 4):
    print(a, 'рубля')
if (b % 100) // 10 == 1:
    print(b, 'копейки')
elif b % 10 in (0, 5, 6, 7, 8, 9):
    print(b, 'копеек')
elif b % 10 == 1:
    print(b, 'копейкa')
elif b % 10 in (2, 3, 4):
    print(b, 'копейки')
