"""
Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение.
"""
a = 10
b = 15

print(a + b)
print(a - b)
print(a * b)
