# Получить на ввод количество рублей и копеек и вывести в правильной
# форме, например, 3 рубля, 1 рубль 25 копеек, 3 копейки
a = input("введите сумму (например: 235,98 ): ")
b = a.split(",")
rub = b[0]
kop = b[1]
if int(rub[-1:]) == 1 and int(rub[-2:]) != 11:
    s_1 = "рубль"
elif int(rub[-1:]) in [2, 3, 4] and int(rub[-2:]) not in [12, 13, 14]:
    s_1 = "рубля"
else:
    s_1 = "рублей"
if int(kop[-1:]) == 1 and int(kop[-2:]) != 11:
    s_2 = "копейка"
elif int(kop[-1:]) in [2, 3, 4] and int(kop[-2:]) not in [12, 13, 14]:
    s_2 = "копейки"
else:
    s_2 = "копеек"
print(rub, s_1, kop, s_2)
