"""
Ввести с клавиатуры имя пользователя.
Вывести на экран “Hello, [name]!”
"""

name = input('Enter your name: ')
print(f'Hello {name}!')
