# Создать строку равную введенной строку без последних двух символов.
a = input('Enter some string\n')
print(a[:- 2])
