# Запросить у пользователя два целых числа.
# Вывести строку вида “2 плюс 3 равно 5”
# Примечание: после ввода переменных преобразовать переменные к типу int
a = int(input("Введите число 1:\n"))
b = int(input("Введите число 2:\n"))
print(f"{a} плюс {b} равно {a+b}")
