a = "third string"
print(a[:5])
# Создать строку равную первым пяти символам введенной строки.
