# Создать строку равную предпоследнему символу введенной строки.

s = 'hello world'
a = s[-2]
print(a)
