#  Task № 3
#  Дана длина ребра куба.
#  Найти объем куба и площадь его боковой поверхности

L = int(input('Введите значение "L_длина ребра куба, см:"'))

v = L ** 3

s = 4 * L ** 2

print(v, s)

