# Создать строку равную третьему символу введенной строки.
a = input('Enter some string\n')
print(a[2])
