# Создать строку равную предпоследнему символу введенной строки.
a = input("введите строку: ")
s1 = a[-2]
print(s1)
