a = float(input("Enter 1 number"))
b = float(input("Enter 2 number"))
c = (a + b) / 2
d = (a * b) ** 0.5
print("Arifm = ", c, "Geom = ", d)
# Даны два действительных числа. Найти среднее арифметическое и
# среднее геометрическое этих чисел
