# Даны 2 действительных числа a и b. Получить их сумму, разность и
# произведение

a = float(input("Enter a"))
b = float(input("Enter b"))
s = a + b
r = a - b
p = a * b
print("sum =", s, "dif =", r, "pr =", p)
