# Создать строку равную предпоследнему символу введенной строки.
a = "second string"
print(a[-2])
