# Дан список. Создать новый список, сдвинутый на 1 элемент влево
# Пример: 1 2 3 4 5 -> 2 3 4 5 1
a = [1, 2, 3, 4, 5]
b = []
# 1е решение через цикл for
for i in range(1 - len(a), 1):
    b.append(a[i])
print(b)
# 2е решение через цикл while
i = -4
c = []
while i <= 0:
    c.append(a[i])
    i += 1
print(c)
