# Создать строку равную введенной строку без последних двух символов.
a = "fourth string"
print(a[:- 2])
