#Создать строку равную первым пяти символам введенной строки
a=input("введите строку: ")
s1=a[:5]
print(s1)