a = "first string"
print(a[2])
# Создать строку равную третьему символу введенной строки.
