# Создать строку равную предпоследнему символу введенной строки
str = input('Введите строку: ')
print(str[-2])
