# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
import math
a = 18
b = 6.6
sr_arf = (a + b) / 2
sr_geom = math.sqrt(a * b)
print(f"a= {a} \nb=  {b}  \nСреднее арифметическое a и b: {sr_arf} "
      f"\nСреднее геометрическое a и b: {sr_geom}")
# kkk
