# Создать строку равную первым пяти символам введенной строки.
a = input('Enter some string\n')
print(a[:5])
