"""
Создать строку равную предпоследнему символу введенной строки
"""
a = input()
print(a[-2])
