# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = 6.8
v = a**3
s = a**2
print(f"Длина ребра куда: a= {a} \nОбьем куба:"
      f" V= {v} \nПлощадь бок. пов-ти: S= {s}")
# print("Длина ребра куда: a="+str(a) + "\nОбьем куба:
# V="+str(v)+ "\nПлощадь бок. пов-ти: S="+str(s))
