# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”
a = input('enter your name\n')
print('Hello, ' + a + ' !')
